In [1]:
import pandas as pd

In [5]:
inter_df=pd.read_csv("../data/raw/interactions.csv")
prod_df=pd.read_csv("../data/raw/products.csv")
users_df=pd.read_csv("../data/raw/users.csv")

In [6]:
inter_df.head()

   user_id  product_id interaction_type   timestamp  rating
0      614         899             view  2023-12-14     NaN
1      239         923            click  2023-12-10     NaN
2      524         453             view  2023-12-26     NaN
3      392         343             view  2023-04-28     NaN
4      354         616             view  2023-08-25     NaN

In [7]:

prod_df.head()

,product_id,category,product_name,price
0,1,Sports,Everlast Heavy Punching Bag,35000.0
1,2,Electronics,Logitech MX Keys Advanced Wireless Keyboard,25000.0
2,3,Electronics,DJI Avata FPV Drone,225000.0
3,4,Books,The Mountain Is You by Brianna Wiest,1800.0
4,5,Books,Grit by Angela Duckworth,1800.0

In [8]:
users_df.head()

   user_id  age  gender    location
0        1   42  Female  Biratnagar
1        2   19    Male   Kathmandu
2        3   25    Male    Lalitpur
3        4   20  Female    Tulsipur
4        5   58  Female   Kathmandu

In [9]:
duplicated_inter_df = inter_df[inter_df.duplicated()]

In [10]:
duplicated_inter_df

     user_id  product_id interaction_type   timestamp  rating
98       239         923            click  2023-12-10     NaN
157      939         547             rate  2023-12-14     2.0
219      532         357            click  2023-10-27     NaN
254      213         150             view  2023-05-15     NaN
255      753         171             view  2023-06-12     NaN

In [11]:
inter_df.drop_duplicates(inplace=True)

In [12]:
inter_df[inter_df.duplicated()]

Empty DataFrame
Columns: [user_id, product_id, interaction_type, timestamp, rating]
Index: []

In [13]:
inter_df[['interaction_type', 'user_id', 'product_id', 'timestamp']].isna().sum()

interaction_type    0
user_id             0
product_id          0
timestamp           0
dtype: int64

In [14]:
prod_df.head()

,product_id,category,product_name,price
0,1,Sports,Everlast Heavy Punching Bag,35000.0
1,2,Electronics,Logitech MX Keys Advanced Wireless Keyboard,25000.0
2,3,Electronics,DJI Avata FPV Drone,225000.0
3,4,Books,The Mountain Is You by Brianna Wiest,1800.0
4,5,Books,Grit by Angela Duckworth,1800.0

In [15]:
prod_df_duplicate = prod_df[prod_df.duplicated()]

In [16]:
prod_df_duplicate

,product_id,category,product_name,price
305,302,Home & Kitchen,Philips Smart LED Bulbs,5000.0
306,303,Beauty,Fenty Beauty Pro Filt’r Soft Matte Foundation,7500.0
307,304,Electronics,Sony Bravia 65-inch OLED TV,280000.0
308,305,Sports,Everlast Powerlock 2 Boxing Gloves,18000.0
640,633,Sports,Puma Ultra Ultimate Football Boots,19500.0
641,634,Beauty,Huda Beauty Eyeshadow Palette,6200.0
642,635,Home & Kitchen,Morphy Richards Coffee Maker,15000.0
643,636,Home & Kitchen,LG Double Door Refrigerator,120000.0
704,692,Electronics,HyperX Alloy Origins Mechanical Keyboard,20000.0
705,693,Beauty,Tatcha Luminous Dewy Skin Mist,7000.0
706,694,Clothing,Nike Air Force 1 Sneakers,15000.0
707,695,Home & Kitchen,Ninja Foodi Dual Basket Air Fryer,50000.0
708,696,Clothing,Hugo Boss Linen Suit,100000.0
824,810,Clothing,Montblanc Leather Wallet,30000.0
825,811,Clothing,Hugo Boss Linen Suit,100000.0
877,862,Electronics,Razer BlackShark V2 Pro Headset,28000.0

In [17]:
prod_df.drop_duplicates(inplace=True)

In [18]:
prod_df[prod_df.duplicated()]

Empty DataFrame
Columns: [product_id, category, product_name, price]
Index: []

In [19]:
prod_df.isna().sum()

product_id      0
category        2
product_name    2
price           2
dtype: int64

In [20]:
prod_df.dropna(subset=['category', 'product_name', 'price'], inplace=True)

In [21]:

prod_df.isna().sum()

product_id      0
category        0
product_name    0
price           0
dtype: int64

In [22]:
users_df.head()

   user_id  age  gender    location
0        1   42  Female  Biratnagar
1        2   19    Male   Kathmandu
2        3   25    Male    Lalitpur
3        4   20  Female    Tulsipur
4        5   58  Female   Kathmandu

In [23]:
users_df_duplicate = users_df[users_df.duplicated()]

In [24]:
users_df_duplicate

     user_id  age  gender    location
638      679   24  Female    Janakpur
680      679   24  Female    Janakpur
813      811   22    Male  Biratnagar
846      811   22    Male  Biratnagar
864      912   50  Female   Kathmandu
880      811   22    Male  Biratnagar
918      912   50  Female   Kathmandu

In [25]:
users_df.drop_duplicates(inplace=True)

In [26]:
users_df[users_df.duplicated()]

Empty DataFrame
Columns: [user_id, age, gender, location]
Index: []

In [27]:
users_df.isna().sum()

user_id     0
age         0
gender      0
location    0
dtype: int64

In [29]:
inter_df.to_csv("../data/cleaned/interactions_cleaned.csv", index=False)
prod_df.to_csv("../data/cleaned/products_cleaned.csv", index=False)
users_df.to_csv("../data/cleaned/users_cleaned.csv", index=False)